import PrivacyPolicy from "@/app/docs/privacy-policy/page";
import { Metadata } from "next";

export async function generateMetadata(): Promise<Metadata> {
  return {
    title: "Политика конфиденциальности — Tutorio",
    description: "Политика конфиденциальности сервиса Tutorio",
    keywords: [
      "Политика конфиденциальности",
      "Tutorio",
      "правила сервиса",
      "условия использования",
      "договор оферта",
      "репетиторский сервис",
      "онлайн обучение",
      "поиск репетиторов",
      "поиск учеников",
      "платформа для репетиторов",
      "услуги онлайн-обучения",
      "обязанности пользователя",
      "ответственность сторон",
      "согласие с условиями",
      "регистрация на платформе",
      "использование сайта",
      "дистанционное обучение",
      "взаимодействие с учениками",
      "взаимодействие с репетиторами",
    ],
  };
}

export default PrivacyPolicy;
