import { City } from "@/types/types";

export const locations: City[] = [
  {
    id: "1",
    title: "Москва",
    area: "Московская область",
    shortTitle: "Москва и область",
    districts: [
      {
        id: "1",
        title: "Центральный",
        metros: [
          {
            id: "14235",
            title: "Баррикадная",
            color: "brown",
            lineName: "Таганско-Краснопресненская линия",
            lineNumber: "7",
          },
          {
            id: "232342",
            title: "Краснопресненская",
            color: "red",
            lineName: "Кольцевая линия",
            lineNumber: "5",
          },
        ],
      },
      {
        id: "2",
        title: "Юго-Западный",
        metros: [
          {
            id: "6",
            title: "Юго-Западная",
            color: "green",
            lineName: "Линия",
            lineNumber: "1",
          },
          {
            id: "7",
            title: "Фрунзенская",
            color: "green",
            lineName: "Линия",
            lineNumber: "1",
          },
        ],
      },
    ],
    regionalCities: [
      {
        id: "1031452",
        title: "пос. Володарского",
      },
      {
        id: "10314522334",
        title: "г. Видное",
      },
      {
        id: "103145221214",
        title: "г. Дзержинский",
      },
    ]
  },
  {
    id: "2",
    title: "Санкт-Петербург",
    area: "Ленинградская область",
    shortTitle: "Санкт-Петербург и область",
    districts: [
      {
        id: "1325345",
        title: "Питерский",
        metros: [
          {
            id: "10",
            title: "Литический проспект",
            color: "brown",
            lineName: "Таганско-Краснопресненская линия",
            lineNumber: "7",
          },
          {
            id: "20",
            title: "Ворошиловская",
            color: "red",
            lineName: "Кольцевая линия",
            lineNumber: "5",
          },
        ],
      },
      {
        id: "221343145",
        title: "Западный",
        metros: [
          {
            id: "6432543",
            title: "Студенческая",
            color: "green",
            lineName: "Линия 6",
            lineNumber: "6",
          },
          {
            id: "70",
            title: "Балтийская",
            color: "green",
            lineName: "Линия 6",
            lineNumber: "6",
          },
        ],
      },
    ],
    regionalCities: [
      {
        id: "103341452",
        title: "г. Лосиный",
      },
      {
        id: "10314531222334",
        title: "г. Кронштадт",
      },
    ]
  },
  {
    id: "3",
    title: "Волгоград",
    area: "Волгоградская область",
    shortTitle: "Волгоградская область",
    districts: [],
    regionalCities: []
  },
  {
    id: "4",
    title: "Самара",
    area: "Самарская область",
    shortTitle: "Самарская область",
    districts: [],
    regionalCities: []
  },
  {
    id: "5",
    title: "Пенза",
    area: "Пензенская область",
    shortTitle: "Пензенская область",
    districts: [],
    regionalCities: []
  },
  {
    id: "6",
    title: "Владивосток",
    area: "Приморский край",
    shortTitle: "Приморский край",
    districts: [],
    regionalCities: []
  },
  {
    id: "7",
    title: "Ростов-на-Дону",
    area: "Ростовская область",
    shortTitle: "Ростовская область",
    districts: [],
    regionalCities: []
  },
  {
    id: "8",
    title: "Луганск",
    area: "Луганская область",
    shortTitle: "Луганская область",
    districts: [],
    regionalCities: []
  },
  {
    id: "9",
    title: "Донецк",
    area: "Донецкая область",
    shortTitle: "Донецкая область",
    districts: [],
    regionalCities: []
  },
  {
    id: "10",
    title: "Мариуполь",
    area: "Донецкая область",
    shortTitle: "Донецкая область",
    districts: [],
    regionalCities: []
  },
  {
    id: "11",
    title: "Саратов",
    area: "Саратовская область",
    shortTitle: "Саратовская область",
    districts: [],
    regionalCities: []
  },
  {
    id: "12",
    title: "Вологда",
    area: "Вологодская область",
    shortTitle: "Вологодская област",
    districts: [],
    regionalCities: []
  },
  {
    id: "13",
    title: "Рыбинск",
    area: "Ярославская область",
    shortTitle: "Ярославская область",
    districts: [],
    regionalCities: []
  },
  {
    id: "14",
    title: "Салехард",
    area: "Ямало-Ненецкий АО",
    shortTitle: "Ямало-Ненецкий АО",
    districts: [],
    regionalCities: []
  },
];

// Третьяковская
// Медведково
// Первомайская
// Калужская
// Каховская
// Бульвар адмирала Ушакова
// Павелецкая
// Волжская
// Шаболовская
// Плющиха
// Тимирязевская
// ВДНХ
// Тверская
// Фонвизинская
// Воронцовская
// Дмитровская
// Новые Черёмушки
// Улица Милашенкова
// Пушкинская
// Маяковская
// Нижегородская
// Ботанический сад
// Нижегородская
// Белорусская
// Красногвардейская
// Комсомольская
// Нагатинская
// Алтуфьево
// Новопеределкино
// Автозаводская
// Дорогомиловская
// Текстильщики
// Кожуховская
// Марьино
// Павелецкая
// Преображенская площадь
// Новослободская
// Фили
// Кунцевская
// Домодедовская
// Мнёвники
// Охотный ряд
// Новокосино
// Курская
// Лухмановская
// Достоевская
// Москва-Сити
// Борисово
// Выставочный центр
// Беговая
// Терехово
// Третьяковская
// Савёловская
// Волоколамская
// Парк Победы
// Чертановская
// Парк Победы
// Филёвский парк
// Фрунзенская
// Кузнецкий мост
// Лубянка
// Улица Сергея Эйзенштейна
// Водный стадион
// Улица 1905 года
// Ломоносовский проспект
// Марксистская
// Боровское шоссе
// Партизанская
// Улица академика Янгеля
// Краснопресненская
// Авиамоторная
// Чкаловская
// Тульская
// Лермонтовский проспект
// Спартак
// Арбатская
// Аннино
// Севастопольская
// Профсоюзная
// Арбатская
// Улица Горчакова
// Мякинино
// Октябрьская
// Пионерская
// Площадь Ильича
// Рассказовка
// Нагатинский Затон
// Измайловская
// Косино
// Битцевский парк
// Сокол
// Рижская
// Сокольники
// Смоленская
// Парк культуры
// Мичуринский проспект
// Котельники
// Библиотека имени Ленина
// Некрасовка
// Волгоградский проспект
// Трубная
// Динамо
// Алексеевская
// Улица Академика Королёва
// Планерная
// Спортивная
// Суворовская
// Таганская
// Киевская
// Театральная
// Сокольники
// Деловой центр
// Бульвар Дмитрия Донского
// Шипиловская
// Белорусская
// Полянка
// Крылатское
// Сходненская
// Площадь Революции
// Юго-Западная
// Шоссе Энтузиастов
// Китай-город
// Щукинская
// Лесопарковая
// Новогиреево
// Курская
// Минская
// Студенческая
// Пражская
// Парк культуры
// Аэропорт
// Проспект Мира
// Третьяковская
// Марьина роща
// Китай-город
// Авиамоторная
// Нахимовский проспект
// Алма-Атинская
// Цветной бульвар
// Окружная
// Добрынинская
// Технопарк
// Серпуховская
// Каширская
// Жулебино
// Селигерская
// Юго-Восточная
// Солнцево
// Пятницкое шоссе
// Улица Скобелевская
// Воробьёвы горы
// Мичуринский проспект
// Верхние Лихоборы
// Строгино
// Отрадное
// Кузьминки
// Кунцевская
// Окская
// Митино
// Академическая
// Пролетарская
// Деловой центр
// Тургеневская
// Беляево
// Царицыно
// Волхонка
// Киевская
// Полежаевская
// Текстильщики
// Войковская
// Саларьево
// Братиславская
// Южная
// Киевская
// Славянский бульвар
// Свиблово
// Университет
// Улица Старокачаловская
// Электрозаводская
// Ясенево
// Румянцево
// Тропарёво
// Таганская
// Орехово
// Перово
// Телецентр
// Дубровка
// Каширская
// Семёновская
// Стахановская
// Кунцевская
// Петровско-Разумовская
// Тёплый стан
// Выхино
// Кантемировская
// Молодёжная
// Владыкино
// Крестьянская застава
// Хорошёвская
// Зябликово
// Петровско-Разумовская
// Красносельская
// Чистые пруды
// Лианозово
// Комсомольская
// Сретенский бульвар
// Проспект Вернадского
// Боровицкая
// Бибирево
// Речной вокзал
// Люблино
// Бутырская
// Октябрьское поле
// Новокузнецкая
// Кутузовская
// Тушинская
// Коломенская
// Октябрьская
// Проспект Вернадского
// Нагорная
// Деловой центр
// Бунинская аллея
// Рижская
// Новоясеневская
// Бауманская
// Бульвар Рокоссовского
// Черкизовская
// Коньково
// Менделеевская
// улица Дмитриевского
// Электрозаводская
// Раменки
// Смоленская
// Баррикадная
// Багратионовская
// Бабушкинская
// Кропоткинская
// Проспект Мира
// Сухаревская
// Тимирязевская
// Красные ворота
// Печатники
// Рязанский проспект
// Римская
// Александровский сад
// Ленинский проспект
// Чеховская
// Печатники
// Щёлковская
// Ховрино
// Шелепиха
// Площадь Гагарина
// Лихоборы
// Автозаводская
// Шоссе Энтузиастов
// Хорошёво
// Соколиная Гора
// Локомотив
// Кутузовская
// Балтийская
// Владыкино
// Угрешская
// Ботанический сад
// Андроновка
// Дубровка
// Измайлово
// Лужники
// Нижегородская
// Новохохловская
// ЗИЛ
// Верхние Котлы
// Белокаменная
// Ростокино
// Москва-Сити
// Бульвар Рокоссовского
// Стрешнево
// Крымская
// Окружная
// Петровский парк
// ЦСКА
// Шелепиха
// Озёрная
// Говорово
// Беломорская
// Зорге
// Панфиловская
// Коптево
// Савёловская
// Филатов луг
// Прокшино
// Ольховая
// Новомосковская
// Лефортово
// Зюзино
// Народное Ополчение
// Давыдково
// Аминьевская
// Новаторская
// Варшавская
// Марьина Роща
// Кленовый бульвар
// Пыхтино
// Аэропорт Внуково
// Яхромская
// Физтех
// Потапово
// Новаторская
// Университет Дружбы Народов
// Генерала Тюленева
// Тютчевская
