import { GoalForSubject } from "@/types/types";

export const listGoalForSubjects: GoalForSubject[] = [
    {
        id: "1",
        goals: ["Подготовка к ОГЭ", "Подготовка к ЕГЭ", "Повышение успеваемости", "Подготовка к экзамену в вузе", "Подготовка к олимпиаде", "Подготовка к школе", "ДВИ", "ВПР", "Для себя", "Для работы"]
    },
    {
        id: "2",
        goals: ["Повышение успеваемости", "Подготовка к экзамену в вузе", "Подготовка к олимпиаде", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "3",
        goals: ["Подготовка к экзамену в вузе", "Подготовка к конкурсам", "Подготовка к специализированной школе", "Для себя", "Для работы", "Другое", ]
    },
    {
        id: "4",
        goals: ["Повышение успеваемости", "Подготовка к экзамену / контрольной", "Подготовка к школе", "Для себя", "Для работы", "Другое" ]
    },
    {
        id: "5",
        goals: ["Повышение успеваемости", "Подготовка к экзамену в вузе", "Подготовка к контрольной", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "6",
        goals: ["Подготовка к международному экзамену", "Подготовка к экзамену в посольстве", "Подготовка к экзамену в вузе", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "7",
        goals: ["Подготовка к ОГЭ", "Подготовка к ЕГЭ", "Повышение успеваемости", "Подготовка к экзамену в вузе", "Подготовка к олимпиаде", "ВПР", "Подготовка к экзамену в посольстве", "Подготовка к международному экзамену", "Подготовка к International Baccalaureate", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "8",
        goals: ["Подготовка к ЕГЭ", "Повышение успеваемости", "Подготовка к экзамену в вузе", "Подготовка к олимпиаде", "Подготовка к экзамену в посольстве", "Подготовка к международному экзамену", "ВПР", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "9",
        goals: ["Подготовка к ОГЭ", "Подготовка к ЕГЭ", "Повышение успеваемости", "Подготовка к экзамену в вузе", "Подготовка к олимпиаде", "Подготовка к экзамену в посольстве", "Подготовка к международному экзамену", "ВПР", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "10",
        goals: ["Повышение успеваемости", "Помощь по программе", "ВПР по математике", "ВПР по русскому", "ВПР по окружающему миру", "Подготовка к итоговому тестированию", "Подготовка к школе", "Другое"]
    },
    {
        id: "11",
        goals: ["Повышение успеваемости", "Помощь по программе", "ВПР по математике", "Подготовка к итоговому тестированию", "Подготовка к школе", "Другое"]
    },
    {
        id: "12",
        goals: ["Обучение чтению, письму или счёту", "Подготовка по методике", "Другое"]
    },
    {
        id: "13",
        goals: ["Повышение успеваемости", "Подготовка к экзамену в вузе", "Подготовка к контрольной", "Для ребёнка", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "14",
        goals: ["Подготовка к международному экзамену", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "15",
        goals: ["Подготовка к ОГЭ", "Подготовка к ЕГЭ", "Повышение успеваемости", "Подготовка к экзамену в вузе", "Подготовка к олимпиаде", "ВПР", "Подготовка к экзамену в посольстве", "Подготовка к международному экзамену", "Подготовка к International Baccalaureate", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "16",
        goals: ["Подготовка к ОГЭ", "Подготовка к ЕГЭ", "Повышение успеваемости", "Подготовка к экзамену в вузе", "Подготовка к олимпиаде", "ВПР", "Подготовка к экзамену в посольстве", "Подготовка к международному экзамену", "Подготовка к International Baccalaureate", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "17",
        goals: ["Подготовка к международному экзамену", "Подготовка к экзамену в посольстве", "Подготовка к экзамену в вузе", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "18",
        goals: ["Подготовка к международному экзамену", "Подготовка к экзамену в посольстве", "Подготовка к экзамену в вузе", "Для себя", "Для работы", "Другое"]
    },
    {
        id: "19",
        goals: ["Подготовка к международному экзамену", "Подготовка к экзамену в посольстве", "Подготовка к экзамену в вузе", "Для себя", "Для работы", "Другое"]
    }
]